/*
Navicat MySQL Data Transfer

Source Server         : 128.71.100.132
Source Server Version : 80013
Source Host           : 128.71.100.132:3306
Source Database       : wangwang

Target Server Type    : MYSQL
Target Server Version : 80013
File Encoding         : 65001

Date: 2019-06-11 14:20:23
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for shops
-- ----------------------------
DROP TABLE IF EXISTS `shops`;
CREATE TABLE `shops` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `sort` int(10) unsigned NOT NULL,
  `category` varchar(25) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `shop_type` varchar(25) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `shop_show` varchar(25) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `shop_login_user` varchar(25) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `shopname` varchar(25) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `user_dir` varchar(25) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `is_start` int(11) unsigned zerofill NOT NULL,
  `create_time` datetime NOT NULL,
  `update_time` datetime NOT NULL,
  `is_active` int(11) unsigned zerofill DEFAULT NULL,
  `shop_status` int(11) unsigned DEFAULT NULL,
  `handle` bigint(11) unsigned DEFAULT NULL,
  `chrome_port` int(11) unsigned DEFAULT NULL,
  `chrome_pid` bigint(11) unsigned DEFAULT NULL,
  `manger_pid` bigint(11) unsigned DEFAULT NULL,
  `shop_service_status` int(11) unsigned DEFAULT NULL,
  `service_status` int(10) unsigned DEFAULT NULL,
  `log` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `start_time` datetime DEFAULT NULL,
  `refresh_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `id` (`id`),
  KEY `sort` (`sort`),
  KEY `shopname` (`shopname`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- ----------------------------
-- Records of shops
-- ----------------------------
INSERT INTO `shops` VALUES ('1', '9', 'Skin Care(A)', 'LD', '欧珑官方旗舰店', '欧珑官方旗舰店:sycm', '欧珑官方旗舰店', 'AC', '00000000000', '2019-05-28 18:56:03', '2019-05-28 18:56:05', '00000000000', '2', '2494144', '9005', '37520', '18628', '0', '1', '正常运行', '2019-06-11 13:30:08', '2019-06-11 14:19:18');
INSERT INTO `shops` VALUES ('2', '12', 'Skin Care(B)', 'CPD', '欧莱雅官方旗舰店', '欧莱雅官方旗舰店:sycm', '欧莱雅官方旗舰店', 'LRL', '00000000000', '2019-05-28 18:56:43', '2019-05-28 18:56:45', '00000000000', '2', '595652', '9013', '28668', '11336', '0', '2', '正常运行', '2019-06-11 13:30:25', '2019-06-11 14:19:38');
INSERT INTO `shops` VALUES ('3', '4', 'Make Up', 'CPD', '美宝莲旗舰店', '美宝莲旗舰店:刘旗', '美宝莲旗舰店', 'MNY', '00000000000', '2019-05-28 18:57:47', '2019-05-28 18:57:49', '00000000000', '2', '2756166', '9003', '73120', '65892', '0', '2', '正常运行', '2019-06-11 13:30:42', '2019-06-11 14:20:00');
INSERT INTO `shops` VALUES ('4', '14', 'Skin Care(B)', 'CPD', '美即官方旗舰店', '美即官方旗舰店:sycm', '美即官方旗舰店', 'MG', '00000000000', '2019-06-03 17:05:08', '2019-06-03 17:05:10', '00000000000', '2', '1839920', '9002', '71112', '34520', '0', '1', '正常运行', '2019-06-11 13:30:59', '2019-06-11 14:20:08');
INSERT INTO `shops` VALUES ('5', '19', 'Skin Care(C)', 'LD', '羽西官方旗舰店', '羽西官方旗舰店:sycm', '羽西官方旗舰店', 'YS', '00000000000', '2019-06-03 17:05:53', '2019-06-03 17:05:55', '00000000000', '2', '63902506', '9004', '66968', '12036', '0', '1', '正常运行', '2019-06-11 13:31:15', '2019-06-11 14:20:23');
INSERT INTO `shops` VALUES ('6', '8', 'Skin Care(A)', 'LD', 'biotherm碧欧泉官方旗舰店', 'biotherm碧欧泉官方旗舰店:sycm', 'biotherm碧欧泉官方旗舰店', 'BIO', '00000000000', '2019-06-03 17:06:29', '2019-06-03 17:06:31', '00000000000', '2', '171445616', '9021', '72548', '37880', '0', '1', '正常运行', '2019-06-11 13:31:31', '2019-06-11 14:19:26');
INSERT INTO `shops` VALUES ('7', '7', 'Skin Care(A)', 'LD', 'KIEHL\'S科颜氏官方旗舰店', 'kiehls科颜氏官方旗舰店:sycm', 'kiehls科颜氏官方旗舰店', 'KLS', '00000000000', '2019-06-03 17:07:04', '2019-06-03 17:07:06', '00000000000', '2', '989068', '9024', '71516', '39228', '0', '1', '正常运行', '2019-06-11 13:31:48', '2019-06-11 14:19:44');
INSERT INTO `shops` VALUES ('8', '18', 'Skin Care(C)', 'LD', 'HR赫莲娜官方旗舰店', 'hr赫莲娜官方旗舰店:sycm', 'hr赫莲娜官方旗舰店', 'HR', '00000000000', '2019-06-05 19:55:59', '2019-06-05 19:56:02', '00000000000', '2', '10688204', '9001', '30068', '73500', '0', '1', '正常运行', '2019-06-11 13:32:04', '2019-06-11 14:20:00');
INSERT INTO `shops` VALUES ('9', '2', 'Make Up', 'LD', 'GIORGIO 阿玛尼美妆官方旗舰店', '阿玛尼美妆官方旗舰店:sycm', '阿玛尼美妆官方旗舰店', 'GA', '00000000000', '2019-06-05 20:03:07', '2019-06-05 20:03:10', '00000000000', '2', '44044004', '9007', '45184', '62524', '0', '2', '正常运行', '2019-06-11 13:32:21', '2019-06-11 14:20:17');
INSERT INTO `shops` VALUES ('10', '6', 'Make Up', 'CPD', '欧莱雅彩妆官方旗舰店', '欧莱雅彩妆官方旗舰店:sycm', '欧莱雅彩妆官方旗舰店', 'MAKEUP', '00000000000', '2019-06-05 20:05:58', '2019-06-05 20:06:00', '00000000000', '2', '2101994', '9000', '57180', '42056', '0', '1', '正常运行', '2019-06-11 13:32:38', '2019-06-11 14:19:22');
INSERT INTO `shops` VALUES ('11', '10', 'Skin Care(A)', 'LD', 'HOUSE 99浩仕九九官方旗舰店', 'house99官方旗舰店:sycm', 'house99官方旗舰店', 'H99', '00000000000', '2019-06-05 20:13:29', '2019-06-05 20:13:32', '00000000000', '2', '26021324', '9016', '56128', '10060', '0', '1', '正常运行', '2019-06-11 13:48:03', '2019-06-11 14:20:03');
INSERT INTO `shops` VALUES ('12', '16', 'Skin Care(B)', 'PPD', '巴黎欧莱雅沙龙专属旗舰店', '巴黎欧莱雅沙龙专属旗舰店:sycm', '巴黎欧莱雅沙龙专属旗舰店', 'LP', '00000000000', '2019-06-05 20:15:50', '2019-06-05 20:15:52', '00000000000', '2', '5903814', '9011', '62332', '65080', '0', '1', '正常运行', '2019-06-11 13:33:11', '2019-06-11 14:20:01');
INSERT INTO `shops` VALUES ('13', '22', 'Derma', 'ACD', 'cerave适乐肤官方旗舰店', 'cerave适乐肤官方旗舰店:sycm', 'cerave适乐肤官方旗舰店', 'CERAVE', '00000000000', '2019-06-05 20:18:11', '2019-06-05 20:18:14', '00000000000', '2', '787316', '9014', '54000', '46172', '0', '1', '正常运行', '2019-06-11 13:33:27', '2019-06-11 14:20:09');
INSERT INTO `shops` VALUES ('14', '1', 'Make Up', 'LD', 'YSL圣罗兰美妆官方旗舰店', 'ysl圣罗兰美妆官方旗舰店:sycm', 'ysl圣罗兰美妆官方旗舰店', 'YSL', '00000000000', '2019-06-05 20:20:30', '2019-06-05 20:20:34', '00000000000', '2', '96146622', '9010', '62016', '65332', '0', '2', '正常运行', '2019-06-11 13:33:44', '2019-06-11 14:19:13');
INSERT INTO `shops` VALUES ('15', '13', 'Skin Care(B)', 'CPD', '欧莱雅美发官方旗舰店', '欧莱雅美发官方旗舰店:sycm1', '欧莱雅美发官方旗舰店', 'HAIR', '00000000000', '2019-06-05 20:22:18', '2019-06-05 20:22:20', '00000000000', '2', '79237162', '9012', '35504', '45412', '0', '1', '正常运行', '2019-06-11 13:34:00', '2019-06-11 14:19:31');
INSERT INTO `shops` VALUES ('16', '11', 'Skin Care(A)', 'CPD', '欧莱雅男士官方旗舰店', '欧莱雅男士官方旗舰店:sycm', '欧莱雅男士官方旗舰店', 'MEX', '00000000000', '2019-06-05 20:24:11', '2019-06-05 20:24:13', '00000000000', '2', '38604100', '9022', '71196', '10080', '0', '1', '正常运行', '2019-06-11 13:47:17', '2019-06-11 14:19:17');
INSERT INTO `shops` VALUES ('17', '17', 'Skin Care(C)', 'LD', 'lancome兰蔻官方旗舰店', 'lancome兰蔻官方旗舰店:sycm', 'lancome兰蔻官方旗舰店', 'LAN', '00000000000', '2019-06-05 20:26:08', '2019-06-05 20:26:10', '00000000000', '2', '75305768', '9008', '28032', '30132', '0', '1', '正常运行', '2019-06-11 13:34:33', '2019-06-11 14:20:16');
INSERT INTO `shops` VALUES ('18', '21', 'Derma', 'ACD', '修丽可官方旗舰店', '修丽可官方旗舰店:sycm', '修丽可官方旗舰店', 'SKC', '00000000000', '2019-06-05 20:28:07', '2019-06-05 20:28:11', '00000000000', '2', '2232952', '9023', '13320', '46312', '0', '1', '正常运行', '2019-06-11 13:48:39', '2019-06-11 14:19:25');
INSERT INTO `shops` VALUES ('19', '5', 'Make Up', 'CPD', '3ce官方旗舰店', '3ce官方旗舰店:sycm', '3ce官方旗舰店', '3CE', '00000000000', '2019-06-05 20:29:52', '2019-06-05 20:29:54', '00000000000', '2', '30413808', '9019', '40940', '63856', '0', '1', '正常运行', '2019-06-11 13:35:06', '2019-06-11 14:19:22');
INSERT INTO `shops` VALUES ('20', '3', 'Make Up', 'LD', '植村秀官方旗舰店', '植村秀官方旗舰店:sycm', '植村秀官方旗舰店', 'SHU', '00000000000', '2019-06-05 20:31:23', '2019-06-05 20:31:24', '00000000000', '2', '174591284', '9009', '44836', '24504', '0', '1', '正常运行', '2019-06-11 13:35:23', '2019-06-11 14:19:38');
INSERT INTO `shops` VALUES ('21', '15', 'Skin Care(B)', 'PPD', '卡诗官方旗舰店', '卡诗官方旗舰店:sycm', '卡诗官方旗舰店', 'KS', '00000000000', '2019-06-05 20:32:52', '2019-06-05 20:32:55', '00000000000', '2', '1511672', '9018', '65520', '37612', '0', '2', '正常运行', '2019-06-11 13:52:06', '2019-06-11 14:19:13');
INSERT INTO `shops` VALUES ('22', '20', 'Derma', 'ACD', '理肤泉官方旗舰店', '理肤泉官方旗舰店:sycm', '理肤泉官方旗舰店', 'LRP', '00000000000', '2019-06-05 20:34:42', '2019-06-05 20:34:44', '00000000000', '2', '2166310', '9015', '27744', '53960', '0', '1', '正常运行', '2019-06-11 13:35:56', '2019-06-11 14:20:12');
INSERT INTO `shops` VALUES ('23', '24', 'Derma', 'CPD', '勃朗圣泉官方旗舰店', '勃朗圣泉官方旗舰店:sycm', '勃朗圣泉官方旗舰店', 'SGMB', '00000000000', '2019-06-05 20:36:40', '2019-06-05 20:36:42', '00000000000', '2', '132913144', '9020', '54980', '31824', '0', '1', '正常运行', '2019-06-11 13:36:12', '2019-06-11 14:19:13');
INSERT INTO `shops` VALUES ('24', '23', 'Derma', 'ACD', 'vichy薇姿官方旗舰店', 'vichy薇姿官方旗舰店:sycm', 'vichy薇姿官方旗舰店', 'VHY', '00000000000', '2019-06-05 20:37:58', '2019-06-05 20:38:00', '00000000000', '2', '3281072', '9006', '61336', '2960', '0', '1', '正常运行', '2019-06-11 13:46:11', '2019-06-11 14:19:24');
